Revit 2026 API

# Rectangle Class

---

Stores a set of four integers that represent the left, top, right and bottom of a rectangle.

SystemObject Autodesk.Revit.DBRectangle

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Rectangle : IDisposable
```
```vb
Public Class Rectangle
	Implements IDisposable
```
```cpp
public ref class Rectangle : IDisposable
```
```fsharp
type Rectangle =
    class
        interface IDisposable
    end
```

The Rectangle type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Rectangle | Create an empty Rectangle instance with values (0,0,0,0). |
|  | Rectangle(Rectangle) | Constructs a new copy of the input ScreenRectangle object. |
|  | Rectangle(Int32, Int32, Int32, Int32) | Creates an Rectangle instance with the specified four integers that represent the left, top, right and bottom of a rectangle. |

|  | Name | Description |
| --- | --- | --- |
|  | Bottom | The y-coordinate of the bottom-right corner of the rectangle. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Left | The x-coordinate of the top-left corner of the rectangle. |
|  | Right | The x-coordinate of the bottom-right corner of the rectangle. |
|  | Top | The y-coordinate of the top-left corner of the rectangle. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the Rectangle |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsNormalized | Returns true if the rectangle coordinates are normalized to the screen coordinate space; that is, left is less than right and top is less than bottom. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

It usually represents a rectangle on the screen. Left must be less than right and top must be less than bottom.

#### Reference

Autodesk.Revit.DB Namespace